Update patterns.md
